/**************************************************************************
文件名称：	Drv_LED.c
说    明：	LED驱动函数集合（中间层）
作    者:	Liaoy
版    本：	V1.0
芯	  片:	SN8P29XX
修订记录：
**************************************************************************/
#include "Include.h"


//底层驱动（io is sink mode）
void Drv_Led_Set(void)
{
	FP55M = 1;		//输出为0
	FP56M = 1;		//输出为0
	FP57M = 1;		//输出为0
	LED_CloseAll();
}

/**************************************************************************
	CLose LED
**************************************************************************/
void LED_CloseAll( void )
{
	LED_Red_Dis();
	LED_Yellow_Dis();
	LED_Green_Dis(); 
	LED_White_Dis();
}
